# SQL Lesson 8: Une brève note sur les NULL

Comme promis dans la dernière leçon, nous allons parler rapidement des valeurs **NULL** dans une base de données SQL. Il est toujours bon de réduire la possibilité de valeurs NULL dans les bases de données car elles nécessitent une attention particulière lors de la construction de requêtes, de contraintes (certaines fonctions se comportent différemment avec des valeurs nulles) et lors du traitement des résultats.

Une alternative aux valeurs NULL dans votre base de données est d'avoir * des valeurs par défaut appropriées au type de données *, comme 0 pour les données numériques, des chaînes vides pour les données texte, etc. Mais si votre base de données a besoin de stocker des données incomplètes, les valeurs NULL peuvent être appropriées si les valeurs par défaut faussent l'analyse ultérieure (par exemple, lors de la prise de moyennes de données numériques).

Parfois, il n'est pas non plus possible d'éviter les valeurs **NULL**, comme nous l'avons vu dans la dernière leçon lors de la jonction externe de deux tables avec des données asymétriques. Dans ces cas, vous pouvez tester une colonne pour les valeurs **NULL** d'une clause **WHERE** à l'aide de la contrainte **IS NULL** ou **IS NOT NULL.**

Sélectionnez une requête avec des contraintes sur les valeurs NULL
``` mysql 
SELECT column, another_column, …
FROM mytable
WHERE column IS/IS NOT NULL
AND/OR another_condition
AND/OR …;
```

## Exercice

Cet exercice sera une sorte de revue des dernières leçons. Nous utilisons le même tableau **employes** et **batiments** de la dernière leçon, mais nous avons embauché quelques personnes supplémentaires, qui n'ont pas encore reçu de bâtiment.

In [1]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [2]:
from pandasql import sqldf

In [3]:
x="""Building_name	Capacity
1e	24
1w	32
2e	16
2w	20"""

In [4]:
batiments=to_df(x)# buildings

In [5]:
batiments

  Building_name Capacity
0            1e       24
1            1w       32
2            2e       16
3            2w       20

In [36]:
y="""Role	Name	Building	Years_employed
Engineer	Becky A.	1e	4
Engineer	Dan B.	1e	2
Engineer	Sharon F.	1e	6
Engineer	Dan M.	1e	4
Engineer	Malcom S.	1e	1
Artist	Tylar S.	2w	2
Artist	Sherman D.	2w	8
Artist	Jakob J.	2w	6
Artist	Lillia A.	2w	7
Artist	Brandon J.	2w	7
Manager	Scott K.	1e	9
Manager	Shirlee M.	1e	3
Manager	Daria O.	2w	6
Engineer	Yanci I.		0
Artist	Oliver P.		0"""

In [37]:
employes=to_df(y) #employees

In [38]:
employes

        Role        Name Building Years_employed
0   Engineer    Becky A.       1e              4
1   Engineer      Dan B.       1e              2
2   Engineer   Sharon F.       1e              6
3   Engineer      Dan M.       1e              4
4   Engineer   Malcom S.       1e              1
5     Artist    Tylar S.       2w              2
6     Artist  Sherman D.       2w              8
7     Artist    Jakob J.       2w              6
8     Artist   Lillia A.       2w              7
9     Artist  Brandon J.       2w              7
10   Manager    Scott K.       1e              9
11   Manager  Shirlee M.       1e              3
12   Manager    Daria O.       2w              6
13  Engineer    Yanci I.                       0
14    Artist   Oliver P.                       0

1. Trouvez le nom et le rôle de tous les employés qui n'ont pas été affectés à un bâtiment

In [45]:
QUERY1 = "SELECT Name, Role FROM employes WHERE Building = '';"

In [46]:
sqldf(QUERY1)

        Name      Role
0   Yanci I.  Engineer
1  Oliver P.    Artist

2. Trouvez les noms des bâtiments qui n'occupent aucun employé

In [49]:
QUERY2 = "SELECT Building_name FROM batiments WHERE Building_Name NOT IN (SELECT DISTINCT Building FROM employes WHERE Building is NOT Null);"

In [50]:
sqldf(QUERY2)

  Building_name
0            1w
1            2e